{
  "categories": [
    "tech",
    "marketing",
    "all"
  ],
  "preamble": {
    "tech": {
      "name": "Stephen Mawuli Dormekpor",
      "title": "Full Stack Engineer ",
      "email": "stephen.mawuli.dormekpor@gmail.com",
      "phone": "+233 (571) 697-172",
      "location": "Kumasi , Ghana",
      "linkedin": "mawuli-stephen",
      "portfolio": "ms-web-coral.vercel.app",
      "summary": "Highly skilled Software Engineer with 5 years of experience developing and maintaining scalable web and mobile applications. Proficient in Angular, React/Next.js, Flutter and Node.js. Delivered features that boosted user engagement by 30% and cut load times by 40%. Strong in cross-team collaboration, clean code, and fast-paced startup environments. Seeking remote roles at product-focused companies"
    },


    "marketing": {
      "name": "Stephen Mawuli Dormekpor",
      "title": " Digital Marketing Specialist",
      "email": "stephen.mawuli.dormekpor@gmail.com",
      "phone": "+233 (571) 697-172",
      "location": "Kumasi , Ghana",
      "linkedin": "mawuli-stephen",
      "portfolio": "ms-web-coral.vercel.app",
      "summary": "Results-driven marketing professional with a strong track record in sales and customer acquisition. Skilled in leveraging digital tools, strategic communication, and relationship-building to drive business growth and deliver measurable value to both clients and companies."

    },


    "all": {
      "name": "Stephen Mawuli Dormekpor",
      "title": "Full Stack Developer & Digital Marketing Specialist",
      "email": "stephen.mawuli.dormekpor@gmail.com",
      "phone": "+233 (571) 697-172",
      "location": "Kumasi , Ghana",
      "linkedin": "mawuli-stephen",
      "portfolio": "ms-web-coral.vercel.app",
      "summary": "Multidisciplinary professional with over 15 years of combined experience in software engineering and digital marketing. Proven ability to design and deliver scalable web and mobile applications using modern technologies like React, Next.js, Node.js, Angular, and Flutter—achieving up to 30% increases in user engagement and 40% reductions in load times. Equally experienced in driving business growth through digital campaigns, customer acquisition, and strategic communication—consistently surpassing sales targets and boosting retention. Adept at collaborating across cross-functional teams in fast-paced environments to create results that serve both users and business objectives."

    }
  },

  "hobbies": [
    "Open Source Contributions",
    "Technical Writing",
    "Poetry","Fiction","Guitar",
    "Painting","Nature",
    "Health & Fitness"
  ],

  "projects": [
    {
      "name": "233bite | E-commerce Platform",
      "description": "Fast food store with paystack integration with the capacity to process $50k+ monthly",
      "tech": [
        "Angular",
        "Node.js",
        "Postgres",
        "Paystack"
      ],
      "categories": [
        "tech"
      ]
    },
    {
      "name": "Royal institute of Science and Entreprenuership | School Website",
      "description": "Private Remedial School Website with paystack integration for admission form purchase",
      "tech": [
        "React Js",
        "Node.js",
        "MySql",
        "Paystack",
        "firebase"
      ],
      "categories": [
        "tech"
      ]
    }

  ],

  "competencies": {
    "groups": [
      "Marketing",
      "Technology",
      "Tools and Software",
      "Other"
    ],

    "Marketing": [
      "Direct Sales",
      "SEO/SEM",
      "Content Marketing",
      "Social Media",
      "Google Ads", "Meta Ads",
      "Conversion Optimization",
      "Analytics"
    ],

    "Technology": [
      "JavaScript",
      "TypeScript",
      "React.js",
      "Next.js",
      "Angular",
      "Flutter",
      "Node.js",
      "Express.js",
      "HTML5",
      "CSS3",
      "RESTful APIs",
      "MySQL",
      "PostgreSQL",
      "Firebase",
      "MongoDB"
    ],
    "Tools and Software": [
      "VS Code",
      "Git",
      "GitHub",
      "Postman",
      "Figma",
      "Jira",
      "Google Analytics",
      "HubSpot",
      "Adobe Creative Suite",
      "Vercel",
      "Firebase Hosting"
    ],
    "Other": [
      "Project Management",
      "Team Leadership",
      "Public Speaking",
      "Technical Writing",
      "Agile development",
      "Time management",
      "Cross-functional collaboration"
    ]
  },
  "volunteering": [
    {
      "role": "Co-Organizer & Mentor",
      "organization": "Rails Girls Ghana",
      "date": "2019 - 2022",
      "categories": [
        "tech"
      ],
      "description": "Led initiatives that introduced over 800+ female students to web development fundamentals. Recruited mentors, organized workshops, and secured funding to support event logistics and outreach."
    },
    {
      "role": "Developer",
      "organization": "DjangoCon Africa",
      "date": "2023",
      "categories": [
        "tech"
      ],
      "description": "Contributed to the development of the official DjangoCon Africa 2023 event website, supporting open-source collaboration and community engagement across the continent."
    }
  ],
  "experiences": [
    {
      "role": "Full Stack Developer",
      "company": "AmaliTech",
      "period": "2025 - Present",
      "categories": [
        "tech"
      ],
      "highlights": [
        "Led a team of students in a 6-week volunteer internship to successfully develop a functional TikTok clone, strengthening team collaboration and delivery under tight timelines.",
        "Designed and deployed RESTful APIs for both mobile and web platforms, resulting in seamless cross-platform integration and faster development turnaround.",
        "Defined project scope and implemented best practices in code quality and architecture, improving maintainability and team efficiency.",
        "Set up a CI/CD pipeline using GitHub Actions and Render, which significantly improved code reliability through integrated testing.",
        "Coached team members for weekly demos and stakeholder updates, improving presentation quality and stakeholder engagement.",
        "Resolved critical bugs and mentored team members through technical challenges, accelerating development and boosting team problem-solving confidence."
      ]
    },
    {
      "role": "Full Stack Developer",
      "company": "Cradx Limited Company",
      "period": "2020 - Present",
      "categories": [
        "tech"
      ],
      "highlights": [
        "Led direct communication with clients to gather technical requirements, improving project alignment and reducing revisions by 40%",
        "Designed scalable project architecture and optimized database structure, resulting in faster development cycles and improved app performance",
        "Implemented a CI/CD pipeline using GitHub Actions, Heroku, Render and Firebase, reducing deployment time by 65% and increasing release reliability",
        "Delivered end-to-end ownership of multiple projects, from requirements gathering to deployment, ensuring timely and successful launches",
        "Managed and mentored a team of interns, accelerating onboarding and improving team productivity through structured code reviews and guidance",
        "Contributed to agile team success by actively leading sprint planning, refining tickets, conducting code reviews, and driving continuous improvement"
      ]
    },
{
      "role": "Direct Sales Consultant",
      "company": "Letshego Ghana PLC",
      "period": "2015 - 2023",
      "categories": ["marketing"],
      "highlights": [
        "Generated high-converting social media ad copies that boosted qualified lead engagement by over 40%.",
        "Maintained strong client relationships, contributing to a 75% customer retention rate over 5 years.",
        "Consistently exceeded annual sales targets by disbursing over GHS 100,000 monthly, generating an estimated 150% profit at loan maturity."
      ]
    },
    {
      "role": "Marketing Manager",
      "company": "Cradx Limited Company",
      "period": "2019 - 2023",
      "categories": ["marketing"],
      "highlights": [
        "Drove direct sales campaigns that expanded the customer base by 30% within the first year.",
        "Built a loyal client portfolio, resulting in a 60% repeat customer rate and increased brand trust.",
        "Surpassed annual financial targets with consistent monthly disbursements exceeding GHS 100,000, contributing to a 150% return on investment at product maturity."
      ]
    }
  ]
}